---
kind: method
id: M:Autodesk.Revit.DB.FilterableValueProvider.GetDoubleValue(Autodesk.Revit.DB.Element)
source: html/53315611-9ee7-8e4c-fe20-a3259b3dc8ab.htm
---
# Autodesk.Revit.DB.FilterableValueProvider.GetDoubleValue Method

Gets a double-precision numeric value from the given element.

## Syntax (C#)
```csharp
public double GetDoubleValue(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to query.

## Returns
The double-precision numeric value from the element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null